Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །གཉིས་པ་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡེ་ཤེས་ཕྲ་བ་རྣམ་པ་དུ་མ་ལ་འཇུག་པ་ནི་འདི་ལྟ་སྟེ། སྤྱོད་པ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། འཆི་འཕོ་དང་སྐྱེ་བ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། སྐྱེ་བ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། རྣམ་པར་འཕྲུལ་པ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། མངོན་པར་འབྱུང་བ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། ཚེའི་ཚད་བྱིན་གྱིས་རློབ་པ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། བསྟན་པ་གནས་པ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཕྲ་བ་ལ་འཇུག་པའི་མཁྱེན་པའོ། །དེ་བཞིན་གཤེགས་པའི་གསང་བ་ནི་འདི་ཡིན་ཏེ། སྐུའི་གསང་བ་དང་། གསུང་གི་གསང་བ་དང་། ཐུགས་ཀྱི་གསང་བ་དང་།
en: Second, when they have gained the dharma­dhātu­praveśa meditative stabilization, they understand the many kinds of “subtle knowledge” of the tathāgatas, worthy ones, perfectly complete buddhas; that is, knowledge that enters into subtle conduct, knowledge that enters into subtle death and rebirth, knowledge that enters into subtle conception, knowledge that enters into the subtle leaving of the womb, knowledge that enters into the subtle sports education as a young boy, knowledge that enters into subtle renunciation, knowledge that enters into subtle full awakening, knowledge that enters into the subtle turning of the wheel of Dharma, knowledge that enters into the subtle employment of sustaining power over the lifespan, knowledge that enters into subtle complete nirvāṇa, knowledge that enters into maintenance of the doctrine, and knowledge that enters into the subtle secrets of the tathāgatas.

source: དུས་དང་དུས་མ་ཡིན་པ་རྣམ་པར་དཔྱད་པ་གསང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པ་གསང་བ་དང་། སེམས་ཅན་བསྡུ་བ་དང་ཚར་བཅད་པ་གསང་བ་དང་། ཐེག་པ་ཐ་དད་པ་གསང་བ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པ་དང་དབང་པོ་རྣམ་པར་དབྱེ་བ་གསང་བ་དང་།
en: These subtle secrets of the tathāgatas are as follows: secret of body, secret of speech, secret of mind, secret insight into when is and is not the right time, secret prediction of bodhisattvas, secret attracting and subjugation of beings, secret division of vehicles, secret distinguishing of the conduct and faculties of beings, secret entry into doing and what is to be done, secret conduct and full awakening, and secret comprehension of the basic nature.

source: ལས་སུ་བྱ་བ་ལ་འཇུག་པ་གསང་བ་དང་། སྤྱོད་པ་དང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་གསང་བ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་པ་གསང་བ་དང་། ཡེ་ཤེས་དེ་གཉིས་ཀ་གཅིག་ཏུ་བསྡུས་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་དང་། མོས་པ་དང་ཕྲ་བ་མཁྱེན་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་མཁས་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Having combined those two knowledges together it says they are “skillful in comprehending the thoughts, conduct, and beliefs of all beings and subtle knowledge.”

source: །སེམས་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ནི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་ཐོབ་པར་བསྟན་པ་སྟེ།
en: With unobstructed thoughts teaches obtaining the concordant cause that is the perfection of power.

source: འདི་ལྟར་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་ཀྱི་སྟོབས་ཐོབ་པས་ཐམས་ཅད་ལ་སེམས་ཐོགས་པ་མེད་པར་འགྱུར་ཏེ། སྟོབས་དེ་དག་ཀྱང་གང་ཞེ་ན། ཉོན་མོངས་པ་ཀུན་དུ་འབྱུང་བ་མེད་པའི་ཕྱིར་བསམ་པའི་སྟོབས་དང་། སའི་ཡེ་ཤེས་ཡོངས་སུ་སྤྱད་པའི་ཕྱིར། ལྷག་པའི་བསམ་པའི་སྟོབས་དང་། བརྗེད་ངས་པ་མེད་པའི་ཆོས་ཅན་གྱི་ཕྱིར་གཟུངས་ཀྱི་སྟོབས་དང་། རྟག་ཏུ་རྣམ་པར་གཡེང་བ་མེད་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྤྱོད་པ་རྣམ་པར་དབྱེ་བ་ལ་མཁས་པའི་ཕྱིར་མངོན་པར་ཤེས་པའི་སྟོབས་དང་།
en: Thus, when they have gained power in its essential matured form their minds become unobstructed by anything.

source: འདོད་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་ཐོབ་པའི་ཕྱིར་དབང་གི་སྟོབས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་དང་རྣམ་པར་དབྱེ་བ་ལ་མཁས་པའི་ཕྱིར་སྤོབས་པའི་སྟོབས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་སྦྱོར་བ་མ་བཏང་བའི་ཕྱིར་སྨོན་ལམ་གྱི་སྟོབས་དང་། བདག་ཉིད་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱ་བའི་སྤྱོད་པ་མ་བཏང་བའི་ཕྱིར་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོབས་དང་།
en: What are those powers?

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་བརྩོན་པ་མ་བཏང་བའི་ཕྱིར་བྱམས་པ་ཆེན་པོའི་སྟོབས་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་སེལ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་དང་། སྒྱུ་མ་ལྟ་བུ་ལ་སོགས་པའི་ཆོས་ཉིད་མངོན་སུམ་དུ་བྱེད་པའི་ཕྱིར་ཆོས་ཉིད་ཀྱི་སྟོབས་དང་། རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་དུ་གྱུར་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱི་སྟོབས་ཏེ།
en: They are the power of intention because they are without the origination of all afflictions; the power of surpassing intention because they have purified the levels’ knowledge; the power of dhāraṇī because they possess the quality of nonforgetfulness; the power of meditative stabilization because they never waver; the power of clairvoyance because they are skillful in analyzing conduct in limitless world systems; the power of faculties because they have gained the fulfillment of all their desires; the power of confidence giving a readiness to speak because they are skilled in the examination and analysis of all the buddhadharmas; the power of prayer because they practice without forsaking the conduct for all the buddhadharmas; the power of perfection because they do not forsake the conduct that will bring their own buddhadharmas to maturity, that will mature all beings, and that will benefit all beings; the power of great love because they do not forsake the effort to rescue all beings; the power of great compassion because they relieve all the suffering of all beings; the power of the true nature of dharmas because they come face to face with the true nature of dharmas that are like illusions and so on; and the power of the sustaining power of all the tathāgatas because omniscience in all its aspects has become manifest.

source: མདོ་ལས་བཤད་པའི་སྟོབས་དེ་དག་ཉིད་དང་ལྡན་པའི་ཕྱིར། ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པའི་ཆོས་ཉིད་ཐོབ་པས་ན། སེམས་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: They are in possession of just these powers that the Sūtra has described, so they have gained the true nature of dharmas that is unobstructed by anything, and therefore it says “with unobstructed thoughts.”

source: །བཟོད་པ་རླབས་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་སྤྲིན་ཞེས་བྱ་བའི་ས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཁྱད་པར་ཅན་དུ་དབང་བསྐུར་བ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་མ་ཐག་ཏུ་རིན་པོ་ཆེའི་རྒྱལ་པོའི་པདྨ་ཆེན་པོའི་སྟེང་དུ།
en: They are endowed with extreme patience. Immediately after they have gained the sarva­jña­jñāna­viśeṣābhiṣekavat meditative stabilization, bodhisattvas stationed on the Dharmameghā level receive consecration with the light rays of the tathāgatas of the ten directions on the precious great king of lotuses.

source: ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་འོད་ཟེར་གྱི་དབང་བསྐུར་བ་ཐོབ་མ་ཐག་ཏུ་སྔར་ཐོབ་པའི་བཟོད་པ་དེ་དག་ཤིན་ཏུ་སྦྱངས་པར་གྱུར་ཏེ། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་སོགས་པ་ཏིང་ངེ་འཛིན་བརྒྱ་ཕྲག་སྟོང་དང་།མི་ཟད་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཀྱི་སྒོ་ལ་སོགས་པ་གཟུང་བརྒྱ་ཕྲག་སྟོང་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་ཚད་མེད་པ་རྣམས་ལ་བཟོད་པ་རྣམས་ཤིན་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་དག་སྐྱེས་པའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ལ་དར་ལས་ཆོད་པ་ཙམ་ཞེས་བྱའོ། །བདག་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་ཉིད་ཀྱིས་གཟུད་པ་མཁྱེན་པ་བཅུ་ཐོབ་པར་བསྟན་པ་སྟེ། ཇི་སྐད་དུ། དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་གཟུད་པ་མཁྱེན་པ་གང་དག་འདི་ལྟ་སྟེ། བྱིས་པའི་ལམ་གཟུད་པ་མཁྱེན་པ་དང་། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱི་གཟུད་པ་མཁྱེན་པ་དང་། ཞིང་གི་ཚོགས་མངོན་པར་རྫོགས་པར་ཐུགས་སུ་ཆུད་པས་གཟུད་པ་མཁྱེན་པ་དང་། སེམས་ཅན་གྱི་ཚོགས་ཀྱི་སེམས་མངོན་པར་རྫོགས་པར་ཐུགས་སུ་ཆུད་པས་གཟུད་པ་མཁྱེན་པ་དང་།
en: Immediately after that all the patience they have gained earlier becomes extremely purified, and the hundred thousand meditative stabilizations—śūraṃgama and so on—the hundred thousand dhāraṇī doors—akṣayakaraṇḍā and so on—and the forbearance for the immeasurable objects within the range of the buddhas arise.

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་མངོན་པར་རྫོགས་པར་ཐུགས་སུ་ཆུད་པས་གཟུད་པ་མཁྱེན་པ་དང་། སྣྲེལ་ཞིར་སྤྱོད་པ་ཀུན་ཏུ་བསྟན་པས་གཟུད་པ་མཁྱེན་པ་དང་།
en: This is “just a sample” of omniscience because those have arisen.

source: མཐུན་པའི་སྤྱོད་པ་ཀུན་ཏུ་བསྟན་པས་གཟུད་པ་མཁྱེན་པ་དང་། མི་མཐུན་པའི་སྤྱོད་པ་ཀུན་ཏུ་བསྟན་པས་གཟུད་པ་མཁྱེན་པ་དང་། འཇིག་རྟེན་རྣམས་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བའི་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྱོད་པ་ཀུན་ཏུ་བསྟན་པས་གཟུད་པ་མཁྱེན་པ་དང་། ཉན་ཐོས་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བ་དང་། རང་སངས་རྒྱས་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བ་དང་།
en: Skilled in causing entry into reality just as it is teaches that they have gained the ten knowledges of causing entry by means of the concordant cause that is the perfection of knowledge: They understand perfectly correctly and well the knowledges that cause entry because they understand the many kinds of knowledge of the tathāgatas, worthy ones, perfectly complete buddhas that cause entry—that is, the knowledge that causes entry through the way of a child, the knowledge that causes entry through dust atoms, the knowledge that causes entry through complete comprehension of the collection of buddhafields, the knowledge that causes entry through the complete comprehension of the thoughts of the collection of beings, the knowledge that causes entry through the complete comprehension that has gone everywhere, the knowledge that causes entry by demonstrating conduct opposite to what is expected, the knowledge that causes entry by demonstrating conduct that goes with the grain, the knowledge that causes entry by demonstrating conduct that goes against the grain, the knowledge that causes entry by demonstrating inconceivable conduct the worldly can understand and inconceivable conduct, and the knowledge that causes entry by demonstrating conduct śrāvakas can understand, pratyekabuddhas can understand, bodhisattvas can understand, and tathāgatas can understand.

source: བྱང་ཆུབ་སེམས་དཔས་རྣམ་པར་ཤེས་པར་བྱ་བ་དང་།
en: Children of the Victor!

source: དེ་བཞིན་གཤེགས་པས་རྣམ་པར་མཁྱེན་པར་བྱ་བའི་སྤྱོད་པ་ཀུན་ཏུ་བསྟན་ནས་གཟུད་པ་མཁྱེན་པ་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པ་ཡངས་ཤིང་ཚད་མེད་པས་འདི་ལ་གནས་པའི་གཟུད་པ་ཤེས་པ་ཡང་ཚད་མེད་དོ་ཞེས་གསུངས་ཏེ།
en: Therefore, since the omniscience of the lord buddhas is vast and immeasurable, the knowledge that causes entry of those standing here is immeasurable too.

source: བླ་ན་མེད་པ་ཐམས་ཅད་ཀྱི་བདག་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་མཁས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This all means “skillful in the reality just as it is of all that is unsurpassed.”

source: །སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པར་བསྟན་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པ་ཐམས་ཅད་རྣམ་པར་བཀོད་པའི་སྨོན་ལམ་དང་འཇུག་པས་ཡོངས་སུ་ཟིན་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To teach the concordant cause that is the perfection of prayer it says having appropriated all the endless arrays of the buddhafields through prayer and setting out.

source: སངས་རྒྱས་ཀྱི་ཞིང་བདེ་བ་ཅན་དང་། པདྨ་ཅན་དང་འདོ་ཅན་ལ་སོགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ན་བཀོད་པ་མཐའ་ཡས་པ་གང་དག་ཡོད་པ་དེ་ལྟ་བུ་འམ། དེ་ལས་ལྷག་པར་བདག་གི་ཡང་གྱུར་ཅིག་ཅེས་སྔོན་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པ་དང་།
en: Because of the prayers they have previously made—“The endless arrays that there are in all the buddhafields such as the Sukhāvatī, Padmavatī, and Arciṣmatī buddhafields, may mine be like them!

source: དེའི་ཕྱིར་བརྩོན་འགྲུས་ཆེན་པོས་འཇུག་པར་བྱས་པ་གང་དག་ཡིན་པའི་སྨོན་ལམ་གྱི་འཇུག་པ་དེ་དག་གིས་ད་ལྟར་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་ཡོངས་སུ་ཟིན་པར་གྱུར་ཏོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Or, may mine surpass them!”—and what they have caused to occur with their great perseverance because of making those prayers, it has now been appropriated within the form of a maturation.

source: །འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ན་བཞུགས་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་རྟག་ཏུ་རྒྱུན་མི་ཆད་པས་མངོན་དུ་གྱུར་པ་ཞེས་བྱ་བ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་བསྟན་པ་སྟེ།
en: With the meditative stabilization recollecting buddhas in an infinite number of world systems constantly and always activated teaches the concordant cause that is the perfection of meditative concentration.

source: སྔོན་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་བསྒོམས་པའི་དབང་གིས། ད་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པའི་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱི་སྤྱན་སྔ་ན་ཐམས་ཅད་དུ་ཐམས་ཅད་ན་སྐད་ཅིག་ཙམ་ཡང་མི་འབྲལ་བར་ལྷུན་གྱིས་གྲུབ་པ་ཉིད་དུ་མངོན་དུ་གྱུར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that because of the force of having earlier cultivated the meditative stabilization that recollects the buddhas, now they are everywhere, always; they are not separated from the presence of all those buddhas in countless, infinite world systems and effortlessly, in a mere instant, are face to face with them.

source: །སངས་རྒྱས་དཔག་ཏུ་མེད་པ་ལ་གསོལ་བ་འདེབས་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བཞུད་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བཞེད་པ་རྣམས་ཡུན་རིང་དུ་བཞུགས་པར་བྱ་བའི་ཕྱིར་གསོལ་བ་འདེབས་པ་ལ་མཁས་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They are skillful in soliciting innumerable buddhas. This means that they are skilled in going into the presence of the lord buddhas abiding in countless, infinite world systems and requesting them to turn the wheel of the Dharma, and in requesting those who want to pass into complete nirvāṇa to stay for a long time.

source: །ལྟ་བ་དང་བག་ལ་ཉལ་དང་ཀུན་ནས་དཀྲིས་པ་དང་ཉོན་མོངས་པ་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་བསྟན་པ་སྟེ།
en: Skillful in eliminating the various views, propensities, obsessions, and defilements teaches the concordant cause that is in harmony with the perfection of skillful means.

source: སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་བག་ལ་ཉལ་དང་། སྤྱོད་པ་དང་མོས་པ་དང་དབང་པོ་ཐ་དད་པ་རྣམས་ལ་གཟིགས་ནས་དེ་དག་གི་ལྟ་བ་ལ་སོགས་པ་ཅི་རིགས་པར་ནན་ཏན་གྱིས་ཞི་བར་བྱ་བ་ལ་མཁས་པ་སྟེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཀྱི་ཡུལ་ཡང་མཁྱེན་ནོ་ཞེས་སྟོན་ཏོ།
en: They see the different aspirations, propensities, conduct, beliefs, and faculties of beings and are skilled in persistently eliminating their views and so on as appropriate. Hence it teaches that they know the range of the tathāgata’s powers as well.

source: །ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་རྩེ་བ་བརྒྱ་ཕྲག་སྟོང་མངོན་པར་སྒྲུབ་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་མངོན་པར་ཤེས་པའི་རྣམ་པར་སྨིན་པ་ལ་དབང་ཐོབ་པར་བསྟན་པ་སྟེ།
en: Skillful in accomplishing a hundred thousand feats through meditative concentration teaches that they have gained mastery over the matured clairvoyances.

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ་བརྒྱ་ཕྲག་སྟོང་གང་ཡིན་པ་དེ་དག་ལ་མཁས་པ་སྟེ།
en: through the power of their meditative stabilization they are skilled in playing with the clairvoyant knowledges in one hundred thousand ways.

source: ཇི་སྐད་དུ་ཡེ་ཤེས་ཀྱི་དབང་དེ་ལྟ་བུ་ཐོབ་ཅིང་ཤིན་ཏུ་རྣམ་པར་བརྟགས་པའི་ཡེ་ཤེས་དང་། མངོན་པར་ཤེས་པ་དང་ལྡན་པ་དེ་འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་དོག་པ་ནི་ཡངས་པར་བྱིན་གྱིས་རློབ་པོ། །འཇིག་རྟེན་གྱི་ཁམས་ཡངས་པ་ནི་དོག་པར་བྱིན་གྱིས་རློབ་པོ།
en: It says: Having gained mastery over such knowledge, with well-examined knowledge and clairvoyant knowledge, as they wish, they make world systems that have contracted expand with their sustaining power, and make world systems that have expanded contract.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་ནི་ཡོངས་སུ་དག་པར་བྱིན་གྱིས་རློབ་པོ། །ཡོངས་སུ་དག་པ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་བྱིན་གྱིས་རློབ་པོ། །དེ་བཞིན་དུ་ཐ་གྲུ་ཆེ་བ་དང་ཆེར་གྱུར་པ་དང་། ཚད་མེད་པ་དང་། ཕྲ་བ་དང་།
en: With their sustaining power, as they wish, they make defiled world systems pure, and make pure world systems defiled; similarly, as supreme leaders, they produce world systems that are spacious, huge, immeasurable, fine, gross, inverted, upside-down, uniformly flat, and so on, and sustain them with their sustaining power.

source: རགས་མ་དང་། སྣྲེལ་ཞི་དང་། སྤྱིའུ་ཚུགས་དང་ངོས་ཕྱལ་བ་ལ་སོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་ཁྱུ་མཆོག་ཏུ་གྱུར་པས་མངོན་པར་བསྒྲུབ་པ་དེ་དང་དེར་བྱིན་གྱིས་རློབ་པོ། །དེ་འདོད་ན་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཁོར་ཡུག་གི་མཐའ་སྐོར་དང་བཅས་པ་ཐམས་ཅད་དང་ལྡན་པ་ཅིག་བྱིན་གྱིས་རློབ་སྟེ། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་ཡང་མི་འཕེལ་ལ།
en: With their sustaining power, as they wish, they put an entire world system and its encircling girdle of mountains into a single dust atom, and they display that performance without making the dust atom any bigger.

source: བྱ་བ་དེ་དག་ཀྱང་ཀུན་ཏུ་སྟོན་ཏོ། །རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་ནས་བརྗོད་དུ་མེད་པའི་བར་ཐམས་ཅད་དང་ལྡན་པའི་ཁོར་ཡུག་གི་འོབས་དང་བཅས་པར་བྱིན་གྱིས་རློབ་སྟེ།
en: With their sustaining power they put two, three, four, or five world systems, up to an inexpressible world system, into a single dust atom, all with their encircling girdles of mountains; and without making the dust atom increase they demonstrate that performance [in reverse].

source: རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་ཡང་མི་འཕེལ་ལ། བྱ་བ་དེ་དག་ཀྱང་ཀུན་ཏུ་སྟོན་ཏོ། །རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་གསུམ་དང་བཞི་དང་ལྔ་ནས་བརྗོད་དུ་མེད་པའི་བར་དུ་ཐམས་ཅད་དང་ལྡན་པ་ཁོར་ཡུག་གི་འོབས་དང་བཅས་པར་བྱིན་གྱིས་རློབ་སྟེ། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་ཡང་མི་འཕེལ་ལ་བྱ་བ་དེ་དག་ཀྱང་ཀུན་ཏུ་སྟོན་ཏོ། །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་ཀྱི་བཀོད་པ་ཀུན་ཏུ་སྟོན་པ་ནས།
en: As they wish, they display the array of two world systems, up to the array of inexpressible world systems, in one world system.

source: འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་བར་གྱི་བཀོད་པ་ཀུན་ཏུ་སྟོན་ཏོ། །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་གི་བཀོད་པ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་སུ་ཀུན་ཏུ་སྟོན་པ་ནས། འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ཀུན་ཏུ་སྟོན་ཏོ།
en: As they wish, they display the array of one world system in two world systems, up to inexpressible world systems.

source: །འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག །འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་ཀུན་ཏུ་སྟོན་ཏེ། སེམས་ཅན་དེ་དག་ལ་གནོད་པ་ཡང་མེད་དོ།
en: They display in one world system as many beings as there are in world systems up to the inexpressible, but without injuring the beings.

source: །འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན། སེམས་ཅན་གྱི་ཁམས་ཇི་སྙེད་ཡོད་པ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་ཏུ་འགོད་དེ། སེམས་ཅན་རྣམས་ལ་གནོད་པ་ཡང་མི་བྱེད་དོ།
en: They display as many beings as there are in one world system in inexpressible world systems, but without injuring the beings.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་སྐྲ་ཙམ་ཁྱོན་གཅིག་ལ་འགོད་དེ། སེམས་ཅན་རྣམས་ལ་གནོད་པར་ཡང་མི་བྱེད་དོ།
en: As they wish, they array beings arrayed in inexpressible world systems on a single strand of hair, but without injuring the beings.

source: །འདོད་ན་སྐྲ་ཙམ་གྱི་ཁྱོན་གཅིག་ལ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བཀོད་པ་གཅིག་ཀུན་ཏུ་སྟོན་ཏོ། །འདོད་ན་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བཀོད་པ་བརྗོད་དུ་མེད་པའི་བར་དག་ཀུན་ཏུ་སྟོན་ཏོ།
en: As they wish, they display a single array of the objects of all the buddhas on a single strand of hair; as they wish, they display up to inexpressible arrays of the objects of all the buddhas.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ཀྱི་ལུས་དང་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གཅིག་ལ་སྤྲུལ་པ་བྱེད་དོ། །ལུས་རེ་རེ་ལ་ཡང་དེ་སྙེད་ཀྱི་ལག་པ་ཀུན་ཏུ་སྟོན་ཏོ།
en: They, as they wish, magically create in a single instant as many bodies as there are dust atoms in inexpressible world systems.

source: །ལག་པ་དེ་དག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་བྱེད་དེ། ལག་པ་རེ་རེས་ཀྱང་མེ་ཏོག་གི་སྐོན་བུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་འཐོར་རོ། །མེ་ཏོག་ལ་ཇི་ལྟ་བར་སྤོས་དང་། མེ་ཏོག་ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་རྒྱལ་མཚན་དང་།
en: They display on each of those bodies that many arms, offer worship to the buddhas in the ten directions with them, and with each of them strew handfuls of flowers over the lord buddhas, as many as the grains of sand in the Gaṅgā River, and, as with the flowers, similarly perfumes, flower garlands, creams, powders, robes, parasols, flags, and banners.

source: བ་དན་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །བཀོད་པ་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ། །ལུས་རེ་རེ་ལ་ཡང་དེ་སྙེད་ཀྱི་མགོ་བྱིན་གྱིས་རློབ་ཀྱི། མགོ་རེ་རེ་ལ་ཡང་དེ་སྙེད་ཀྱི་ལྕེ་བྱིན་གྱིས་བརླབས་ཏེ།
en: Through their sustaining power they sustain on each of those bodies that many heads, and through their sustaining power they sustain in each head that many tongues.

source: ལྕེ་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སྔགས་པ་བརྗོད་དེ།
en: With each of those tongues they extol the buddhas.

source: སེམས་བསྐྱེད་པ་རེ་རེ་ལ་ཡང་ཕྱོགས་བཅུ་ཁྱབ་པར་འགྲོ་སྟེ།
en: Having produced the thought of awakening, each goes pervading the ten directions.

source: དེས་སེམས་བསྐྱེད་པ་ཙམ་གྱིས་ཀྱང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཚད་མེད་པ་ནས། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་བཀོད་པའི་བར་དུ་བྱིན་གྱིས་རློབ་པོ།
en: They also, just by the production of the thought, sustain with their sustaining power infinite, perfect full awakening, up to the great arrays of parinirvāṇa.

source: །དུས་གསུམ་གྱི་ལུས་ཚད་མེད་པ་ཡང་བྱིན་གྱིས་རློབ་པོ། །རང་གི་ལུས་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་རྣམས་ཀྱི། སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་ཚད་མེད་པ་བྱིན་གྱིས་རློབ་པོ། །འཇིག་རྟེན་གྱི་ཁམས་འཇིག་པ་དང་། འཆགས་པ་ཐམས་ཅད་ཀྱང་རང་གི་ལུས་ལ་བྱིན་གྱིས་རློབ་པོ།
en: With their sustaining power they sustain infinite bodies in the three periods of time; they sustain infinite arrays of buddhafields of infinite lord buddhas in their bodies; they sustain in their bodies all the destruction and unfolding of world systems.

source: །རླུང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱང་སྤུའི་ཁུང་བུ་གཅིག་ནས་འབྱིན་ཏེ། སེམས་ཅན་རྣམས་ལ་གནོད་པར་ཡང་མི་བྱེད་དོ།
en: They emit the wind firmaments from a single pore of their bodies, but still without injuring beings.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་མཐར་ཐུག་པ་ཆུའི་ཕུང་པོ་གཅིག་ཏུ་བྱིན་གྱིས་རློབ་པོ། །དེར་ཡང་པདྨ་ཆེན་པོ་བྱིན་གྱིས་རློབ་པོ། །པདྨ་ཆེན་པོ་དེའི་འོད་ཀྱི་བཀོད་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པ་རྒྱས་པར་གང་བར་བྱེད་དེ། དེ་ལ་ཡང་བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་ཡལ་ག་འགྲེལ་བ་ཀུན་ཏུ་སྟོན་པ་ནས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་བར་དུ་ཡང་ཀུན་ཏུ་སྟོན་ཏོ།
en: As they wish, with their sustaining power they sustain the world system as far as the waters as a single mass of water, and on that sustain the great lotus, pervade endless world systems with the array of light that shines from that lotus, and display the great branched-tree of awakening, up to exhibit the omniscience endowed with all the finest aspects.

source: །རང་གི་ལུས་ལ་ཕྱོགས་བཅུའི་ནོར་བུ་དང་། གློག་དང་། ཟླ་བ་དང་ཉི་མའི་འོད་བྱིན་གྱིས་རློབ་པ་ནས། འོད་དང་སྣང་བ་ཐམས་ཅད་ཀྱི་བར་དུ་བྱིན་གྱིས་རློབ་པོ།
en: With their sustaining power they sustain in their bodies the light of jewels, lightning, the sun, and the moon of the ten directions, up to all shining light.

source: །ཁའི་དབུགས་ཀྱིས་ཀྱང་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་གཡོ་བར་བྱེད་དེ། སེམས་ཅན་རྣམས་འཇིག་པར་ཡང་མི་བྱེད་དོ།
en: With a single puff of breath they shake endless world systems in the ten directions but without scaring beings.

source: །ཕྱོགས་བཅུ་རླུང་གིས་འཇིག་པ་དང་། མེས་འཇིག་པ་དང་། ཆུས་འཇིག་པར་ཡང་བྱིན་གྱིས་རློབ་པོ། །འདོད་ན་སེམས་ཅན་ཐམས་ཅད་བསམས་པ་བཞིན་དུ་གཟུགས་ཀྱི་ལུས་ཀྱི་གནས་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་རློབ་པོ། །རང་གི་ལུས་དེ་བཞིན་གཤེགས་པའི་སྐུར་བྱིན་གྱིས་རློབ་པོ།
en: And with their sustaining power they sustain in the ten directions destruction by wind, fire, and water; and in line with their intentions, they sustain, as they wish, the adornment of the physical form-bases of all beings.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་རང་གི་ལུས་སུ་བྱིན་གྱིས་རློབ་པོ། །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་བྱིན་གྱིས་རློབ་པོ། །རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་བྱིན་གྱིས་རློབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་རྣམ་པར་རོལ་པ་མཐའ་ཡས་པ།
en: With their sustaining power they sustain their body in the body of the tathāgata; sustain the body of the tathāgata in their body; sustain their own buddhafield in the body of the tathāgata; and sustain the body of the tathāgata in their own buddhafield.

source: ཚད་མེད་པ་གྲངས་མེད་པ་བརྒྱ་སྟོང་རྣམས་སྟོན་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུའོ།
en: Thus they demonstrate a hundred thousand immeasurable and innumerable, endless amusements such as these.
